Documents/ОплатаБанковскойКартой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОплатаБанковскойКартой</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
				<xr:Item>Document.СчетНаОплату</xr:Item>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
				<xr:Item>Document.ОплатаБанковскойКартой</xr:Item>
				<xr:Item>Document.ВозвратТовараОтПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ВзаиморасчетыСКонтрагентамиПоЗаказДоговорам</xr:Item>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ОплатаПоСчетам</xr:Item>
				<xr:Item>AccumulationRegister.БонусыКонтрагентов</xr:Item>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ОплатаЗаказовНаПроизводство</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоРассрочкам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЭквайрингу</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкВозвращаетКомиссиюПриВозвратеОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОплатаБанковскойКартой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлатежныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КредитныеДоговоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьБонусы</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСменыККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйУчетБонусовПоДисконтнымКартам</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусовКНачислениюПоДисконтнойКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬДатаПлатежаПоРассрочке</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬОплатаПоРассрочке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬСчетНаОплату</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧекФискализирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументНАНБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НастройкаАвтоматическихНачисленийБонусов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаспределениеПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежаПоРассрочке</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
								<v8:Type>cfg:DocumentRef.Замена</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаДоставку</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентамиВВалюте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентамиВВалюте</Name>
			<Comment>Взаиморасчеты с контрагентами в валюте</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ОплатаБанковскойКартой/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ВидОперации") Тогда
			ВидОперации = ДанныеЗаполнения.ВидОперации;
		КонецЕсли;
		// закомментировано: не менять ДанныеЗаполнения, так как ниже ломается создание на основании
		// при необходимости обрабатывать в блоках Если ТипЗнч(ДанныеЗаполнения)
		//Если ДанныеЗаполнения.Свойство("Основание") Тогда
		//	ДанныеЗаполнения = ДанныеЗаполнения.Основание;
		//КонецЕсли;
	КонецЕсли;	
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	//#11129 закомментировано
	//СтатьяДоходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Метаданные().Имя, ВидОперации);
	ЭквайринговыйТерминалПоУмолчанию = ОбщийМодульСервер.НастройкаПользователя("ЭквайринговыйТерминал");
	Если ЗначениеЗаполнено(Организация) Тогда
		Если Организация = ЭквайринговыйТерминалПоУмолчанию.Владелец Тогда
			ЭквайринговыйТерминал = ЭквайринговыйТерминалПоУмолчанию;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ЭквайринговыйТерминалПоУмолчанию) Тогда
			ЭквайринговыйТерминал = ЭквайринговыйТерминалПоУмолчанию;
			Организация = ЭквайринговыйТерминалПоУмолчанию.Владелец;
		КонецЕсли;	
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда
		ОтборСтрок = Новый Структура("Основная", Истина);
		НайденныеСтроки = ЭквайринговыйТерминал.ВидыПлатежныхКарт.НайтиСтроки(ОтборСтрок);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ВидПлатежнойКарты = НайденныеСтроки[0].ВидПлатежнойКарты; 	
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("МассивДокументов") Тогда
			Если ДанныеЗаполнения.МассивДокументов.Количество() > 0 Тогда
				Если ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
					ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения.МассивДокументов);
				ИначеЕсли ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
					ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения.МассивДокументов);
				ИначеЕсли ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.Монтаж") Тогда
					ЗаполнитьПоМонтажу(ДанныеЗаполнения.МассивДокументов);	
				ИначеЕсли ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.СчетНаОплату") Тогда
					ЗаполнитьПоСчетуНаОплату(ДанныеЗаполнения.МассивДокументов);
				ИначеЕсли ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
					ЗаполнитьПоРеализации(ДанныеЗаполнения.МассивДокументов);	
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ДанныеЗаполнения.Свойство("Основание") Тогда
			
			Если ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказДоговор")
				И ДанныеЗаполнения.Свойство("РассрочкаДатаПлатежа") 
				И ДанныеЗаполнения.Свойство("РассрочкаСумма") Тогда
				ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения.Основание, ДанныеЗаполнения.РассрочкаДатаПлатежа, ДанныеЗаполнения.РассрочкаСумма);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
			
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") Тогда
		ЗаполнитьПоМонтажу(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		ЗаполнитьПоСчетуНаОплату(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		ЗаполнитьПоРеализации(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратТовараОтПокупателя") Тогда
		ЗаполнитьПоВозвратуОтПокупателя(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратПродукции") Тогда
		ЗаполнитьПоВозвратуПродукции(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОплатаБанковскойКартой") Тогда
		ЗаполнитьПоОплатеБанковскойКартой(ДанныеЗаполнения);

	КонецЕсли;
	
	Если НЕ ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту 
		ИЛИ ЭквайринговыйТерминал.БанкВозвращаетКомиссиюПриВозвратеОплаты Тогда
		ЗаполнитьПроцентКомиссии();
	КонецЕсли;
	БанкВозвращаетКомиссиюПриВозвратеОплаты = ЭквайринговыйТерминал.БанкВозвращаетКомиссиюПриВозвратеОплаты;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		КатегорияКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Категория");	
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты();
	
	РаспределениеПлатежа.Очистить();	
	ЧекФискализирован = Ложь;
	НомерСменыККМ = 0;
	НомерЧекаККМ = 0;
	ОплатаВыполнена = Ложь;
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ОплатаБанковскойКартой 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту
		Тогда
		Если ПроверяемыеРеквизиты.Найти("КредитныйДоговор") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("КредитныйДоговор"));
		КонецЕсли;	
	Иначе
		Если ПроверяемыеРеквизиты.Найти("ВидПлатежнойКарты") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВидПлатежнойКарты"));
		КонецЕсли;
		Если ПроверяемыеРеквизиты.Найти("ЭквайринговыйТерминал") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ЭквайринговыйТерминал"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьЗаполнениеНаОснованииЗаказа(ЭтотОбъект, Отказ, РежимЗаписи);
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПередЗаписью(ЭтотОбъект, РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	Если ТипЗнч(Договор.Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		ДоговорКонтрагента = Договор.Ссылка;
	ИначеЕсли ТипЗнч(Договор.Ссылка) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		ДоговорКонтрагента = Договор.ДоговорКонтрагента.Ссылка;
	КонецЕсли;
	
	// регистр ВзаиморасчетыСКонтрагентами Расход
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	Движение.ВидДвижения = ?(НЕ ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Контрагент = Контрагент;
	Движение.Договор = ДоговорКонтрагента;
	//Движение.Документ = Ссылка;
	Движение.Сумма = Сумма;
	
	//Взаиморасчеты с контрагентами в валюте
	Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
	Движение.ВидДвижения = ?(НЕ ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Контрагент = Контрагент;
	Движение.Договор = ДоговорКонтрагента;
	Движение.Валюта = ?(ЗначениеЗаполнено(Валюта), Валюта, Константы.ВалютаУчета.Получить());
	Движение.Сумма = Сумма;  	
	
	// регистр РасчетыПоЭквайрингу Приход
	Движения.РасчетыПоЭквайрингу.Записывать = Истина;
	Движение = Движения.РасчетыПоЭквайрингу.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	// если ИспользоватьРаспределениеПоЭквайрингу, то учет ведется с заполнением измерения ВидОперации и возврат отражается как Приход
	// иначе Возврат как Расход - для простой схемы без распределения
	Если ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту И НЕ ПолучитьФункциональнуюОпцию("ИспользоватьРаспределениеПоЭквайрингу") Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЕсли;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.ЭквайринговыйТерминал = ?(НЕ ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.Кредит, ЭквайринговыйТерминал, КредитныйДоговор);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРаспределениеПоЭквайрингу") Тогда
		Движение.Документ = Ссылка; //#6440
		Движение.ВидОперации = ВидОперации; //#7342
	КонецЕсли;
	Движение.Сумма = Сумма; //Сумма - Комиссия; //#7342 пишем всю сумму без минуса комиссии
	Если НЕ ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту 
		ИЛИ БанкВозвращаетКомиссиюПриВозвратеОплаты Тогда
		Движение.КомиссияБанка = Комиссия;
	КонецЕсли;
	
	//регистр ДолгиПоРассрочкам
	Движения.ДолгиПоРассрочкам.Записывать = Истина;
	Для Каждого СтрокаРаспределения Из РаспределениеПлатежа Цикл
		Если ТипЗнч(СтрокаРаспределения.Документ) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			Если НЕ СтрокаРаспределения.Документ.Пустая() Тогда
				Если НЕ СтрокаРаспределения.ДатаПлатежаПоРассрочке = Дата(1,1,1) Тогда
					Движение = Движения.ДолгиПоРассрочкам.Добавить();
					Движение.Период = Дата;
					Движение.ВидДвижения = ?(НЕ ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
					Движение.СрокПлатежа = СтрокаРаспределения.ДатаПлатежаПоРассрочке;
					Движение.ЗаказДоговор = СтрокаРаспределения.Документ;
					//#9779
					//Движение.Сумма = СтрокаРаспределения.Сумма;
					Если СтрокаРаспределения.Документ.Валюта = Валюта ИЛИ СтрокаРаспределения.СуммаВВалютеДокумента = 0 Тогда 
						Движение.Сумма = СтрокаРаспределения.Сумма;
					Иначе
						Движение.Сумма = СтрокаРаспределения.СуммаВВалютеДокумента; 
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	//Распределение РасчетыПоЗаказам
	СписокВидовДокументовПоКоторымВедутсяРасчеты = ОбщийМодуль.ПолучитьМассивТиповДокументовПоКоторымВедутсяРасчетыПоЗаказам();
	Движения.РасчетыПоЗаказам.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из РаспределениеПлатежа Цикл
		НайденныйВидДокумента = СписокВидовДокументовПоКоторымВедутсяРасчеты.Найти(ТипЗнч(ТекущаяСтрока.Документ));
		Если НайденныйВидДокумента <> Неопределено Тогда
			Движение = Движения.РасчетыПоЗаказам.Добавить();
			Движение.Период = Дата;
			// #16759 вид движения всегда расход, знак зависит от вида операции
			//Движение.ВидДвижения = ?(НЕ ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Заказ = ТекущаяСтрока.Документ;
			//Движение.Сумма = ТекущаяСтрока.Сумма;
			Если ТекущаяСтрока.Документ.Валюта = Валюта ИЛИ ТекущаяСтрока.СуммаВВалютеДокумента = 0 Тогда 
				//Движение.Сумма = ТекущаяСтрока.Сумма;
				Движение.Сумма = ?(НЕ ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту, ТекущаяСтрока.Сумма, -ТекущаяСтрока.Сумма);
			Иначе
				//Движение.Сумма = ТекущаяСтрока.СуммаВВалютеДокумента;
				Движение.Сумма = ?(НЕ ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту, ТекущаяСтрока.СуммаВВалютеДокумента, -ТекущаяСтрока.СуммаВВалютеДокумента);
			КонецЕсли;
			Движение.Контрагент = Контрагент; // №6496 добавлен контрагент в измерение
		КонецЕсли;	
	КонецЦикла;
	
	//регистр ВзаиморасчетыСКонтрагентамиПоЗаказам Расход
	Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из РаспределениеПлатежа Цикл
		Если ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			Движение = Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Добавить();
			Движение.ВидДвижения = ?(НЕ ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
			Движение.Период = Дата;
			Движение.Заказ = ТекущаяСтрока.Документ;
			Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);
		КонецЕсли;					
	КонецЦикла;
	
	//ДоходыРасходы
	// #11129 закомментировано: ОБК не должна двигать доходы и расходы кассовым методом, т.к. потом по ОБК будет оформлено ПнРС, 
	//которое по доходом и расходам кассовым методом так же сделает приход и суммы задвоятся.
	
	//Если НЕ СтатьяДоходов.Пустая() И ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов Тогда
	//	Если ПараметрыСеанса.ФинРезультатКассовыйМетодВеденияУчетаДоходовРасходов Тогда
	//		Если ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ОплатаБанковскойКартой
	//			ИЛИ ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.Кредит Тогда
	//			//кассовый метод
	//			Движения.ДоходыРасходы.Записывать = Истина;
	//			Движение = Движения.ДоходыРасходы.Добавить();
	//			Движение.Период 		= Дата;
	//			Движение.Организация 	= Организация;
	//			Движение.Подразделение 	= Подразделение;
	//			Движение.Статья 		= СтатьяДоходов;
	//			Движение.Метод		 	= Перечисления.МетодыВеденияУчетаДоходовРасходов.Кассовый;
	//			Движение.СуммаДоходов 	= Сумма;
	//			Движение.СуммаРасходов 	= 0;
	//		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту Тогда
	//			//кассовый метод
	//			Движения.ДоходыРасходы.Записывать = Истина;
	//			Движение = Движения.ДоходыРасходы.Добавить();
	//			Движение.Период 		= Дата;
	//			Движение.Организация 	= Организация;
	//			Движение.Подразделение 	= Подразделение;
	//			Движение.Статья 		= СтатьяРасходов;
	//			Движение.Метод		 	= Перечисления.МетодыВеденияУчетаДоходовРасходов.Кассовый;
	//			Движение.СуммаДоходов 	= 0;
	//			Движение.СуммаРасходов 	= Сумма;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
	//Бонусы контрагентов
	Движения.БонусыКонтрагентов.Записывать = Истина;
	Если НачислятьБонусы 
		И ?(СлужебныйУчетБонусовПоДисконтнымКартам, НЕ ДисконтнаяКарта.Пустая(), Истина) // №6316 нужно проверить заполнение дисконтной карты
	Тогда
		Если НЕ СуммаБонусовКНачислениюПоДисконтнойКарте = 0 Тогда
			Движение = Движения.БонусыКонтрагентов.Добавить();
			Движение.ВидДвижения = ?(НЕ ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);;
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.ДисконтнаяКарта = ДисконтнаяКарта;
			Движение.Сумма = СуммаБонусовКНачислениюПоДисконтнойКарте;
			Движение.ДокументНАНБ = ДокументНАНБ;
			Движение.КатегорияКонтрагента = КатегорияКонтрагента;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	// №6960 настройки по бонусам делаем только если глобально включен учет бонусов
	Если ПолучитьФункциональнуюОпцию("УчетБонусов") Тогда
		//#13834 изменена настройка
		//НачислятьБонусы 						= Константы.АвтоматическиНачислятьБонусыВДокументахОплаты.Получить();
		НачислятьБонусы 						= Константы.АвтоматическиНачислятьБонусы.Получить();
		СлужебныйУчетБонусовПоДисконтнымКартам 	= Константы.УчетБонусовПоДисконтнымКартам.Получить();
	Иначе
		НачислятьБонусы = Ложь;
		СлужебныйУчетБонусовПоДисконтнымКартам = Ложь;
	КонецЕсли;
	
	ДисконтнаяКарта = Справочники.ДисконтныеКарты.ПустаяСсылка();
	СуммаБонусовКНачислениюПоДисконтнойКарте = 0;
		
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
	Если ЗначениеЗаполнено(Организация) Тогда
		УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация);
		СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
	
		ФинансыКлиентСервер.ПересчитатьСуммуНДС(ЭтотОбъект, УчитыватьНДС);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказа(МассивДокументов);
	
	Контрагент 		= МассивДокументов[0].Контрагент;
	Договор 		= МассивДокументов[0].ДоговорКонтрагента;
	Организация 	= МассивДокументов[0].Организация;
	Подразделение 	= МассивДокументов[0].Подразделение; //#5775 	
	Валюта 			= МассивДокументов[0].Валюта; //#7373
	
	ДобавлятьЗаказыВторогоПорядкаВРаспределение = НЕ Константы.НеДобавлятьЗаказыВторогоПорядкаВРаспределение.Получить();
	ДобавлятьДокументыПродажиПоЗаказам = ПолучитьФункциональнуюОпцию("ДобавлятьДокументПродажиПоЗаказуПриДобавленииЗаказаВРаспределение")
										И Константы.ВестиРасчетыПоЗаказамПоРТиУ.Получить();
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ЭлементМассива;
		НоваяСтрока.Сумма = РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(НоваяСтрока.Документ); //ЭлементМассива.СуммаДокумента;				
		НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
		Если ДобавлятьЗаказыВторогоПорядкаВРаспределение Тогда
			ФинансыСервер.ДобавитьОснованиеЗаказаВРаспределениеПлатежа(ЭлементМассива, РаспределениеПлатежа, Сумма);
		КонецЕсли;
	КонецЦикла;
	
	Сумма = РаспределениеПлатежа.Итог("Сумма");
	
	//#7709 
	//после определения суммы документа
	Если ДобавлятьДокументыПродажиПоЗаказам Тогда
		Для каждого ЭлементМассива из МассивДокументов Цикл
			ФинансыСервер.ДобавитьДокументыПродажиПоЗаказам(ЭтотОбъект, ЭлементМассива);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения, ДатаПлатежаПоРассрочке = '00010101', СуммаПлатежаРассрочки = 0)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Организация 	= МассивДокументов[0].Организация;
	Подразделение 	= МассивДокументов[0].Подразделение; //#12846
	Контрагент 		= МассивДокументов[0].Контрагент;		
	Договор 		= МассивДокументов[0].ДоговорКонтрагента;
	Валюта 			= МассивДокументов[0].Валюта; //#7373
	
	ДобавлятьДокументыПродажиПоЗаказам = ПолучитьФункциональнуюОпцию("ДобавлятьДокументПродажиПоЗаказуПриДобавленииЗаказаВРаспределение")
										И Константы.ВестиРасчетыПоЗаказамПоМонтажу.Получить();
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ЭлементМассива;
		НоваяСтрока.Сумма = РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(НоваяСтрока.Документ); //ЭлементМассива.СуммаДокумента;
		Если СуммаПлатежаРассрочки > 0 Тогда
			НоваяСтрока.Сумма = СуммаПлатежаРассрочки;
			НоваяСтрока.ДатаПлатежаПоРассрочке = ДатаПлатежаПоРассрочке;
		КонецЕсли;
		НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
	КонецЦикла;
	
	Сумма = РаспределениеПлатежа.Итог("Сумма");
	
	//#7709 
	//после определения суммы документа
	Если ДобавлятьДокументыПродажиПоЗаказам Тогда
		Для каждого ЭлементМассива из МассивДокументов Цикл
			ФинансыСервер.ДобавитьДокументыПродажиПоЗаказам(ЭтотОбъект, ЭлементМассива);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоМонтажу(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Контрагент 		= МассивДокументов[0].Контрагент;		
	Организация 	= МассивДокументов[0].Организация;
	Подразделение 	= МассивДокументов[0].Подразделение; // №12857
	Договор 		= МассивДокументов[0].ДоговорКонтрагента;
	Валюта 			= МассивДокументов[0].Валюта; //#7373
	
	НеДобавлятьЗаказыВторогоПорядкаВРаспределение = Константы.НеДобавлятьЗаказыВторогоПорядкаВРаспределение.Получить();
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ЭлементМассива;
		НоваяСтрока.Сумма = РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(НоваяСтрока.Документ); //ЭлементМассива.СуммаДокумента;				
		НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
		Если НЕ НеДобавлятьЗаказыВторогоПорядкаВРаспределение Тогда
			ФинансыСервер.ДобавитьОснованиеЗаказаВРаспределениеПлатежа(ЭлементМассива, РаспределениеПлатежа, Сумма);
		КонецЕсли;
	КонецЦикла;
	
	Сумма = РаспределениеПлатежа.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьПоСчетуНаОплату(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Контрагент 	= МассивДокументов[0].Контрагент;		
	Организация = МассивДокументов[0].Организация;
	Договор 	= МассивДокументов[0].ДоговорКонтрагента;
	Валюта 		= МассивДокументов[0].Валюта; //#7373
	
	НеДобавлятьЗаказыВторогоПорядкаВРаспределение = Константы.НеДобавлятьЗаказыВторогоПорядкаВРаспределение.Получить();
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ЭлементМассива;
		НоваяСтрока.Сумма = РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(НоваяСтрока.Документ); //ЭлементМассива.СуммаДокумента;				
		НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
		Если НЕ НеДобавлятьЗаказыВторогоПорядкаВРаспределение Тогда
			ФинансыСервер.ДобавитьОснованиеЗаказаВРаспределениеПлатежа(ЭлементМассива, РаспределениеПлатежа, Сумма);
		КонецЕсли;
	КонецЦикла;
	
	Сумма = РаспределениеПлатежа.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьПоРеализации(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Контрагент 		= МассивДокументов[0].Контрагент;		
	Организация 	= МассивДокументов[0].Организация;
	Подразделение 	= МассивДокументов[0].Подразделение; // №12857
	Договор 		= МассивДокументов[0].ДоговорКонтрагента;
	Валюта 			= МассивДокументов[0].Валюта; //#7373
	
	НеДобавлятьЗаказыВторогоПорядкаВРаспределение = Константы.НеДобавлятьЗаказыВторогоПорядкаВРаспределение.Получить();
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ЭлементМассива;
		НоваяСтрока.Сумма = РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(НоваяСтрока.Документ); //ЭлементМассива.СуммаДокумента;				
		НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
		Если НЕ НеДобавлятьЗаказыВторогоПорядкаВРаспределение Тогда
			ФинансыСервер.ДобавитьОснованиеЗаказаВРаспределениеПлатежа(ЭлементМассива, РаспределениеПлатежа, Сумма);
		КонецЕсли;
	КонецЦикла;
	
	Сумма = РаспределениеПлатежа.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьПоОплатеБанковскойКартой(ДанныеЗаполнения)
	
	Если НЕ ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ОплатаБанковскойКартой Тогда				
		ТекстОшибки = НСтр("ru='Не предусмотрен ввод на основании для текущего вида операции'");	
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Дата, Номер, ВидОперации, Комментарий, Комиссия, 
															| НомерСменыККМ, НомерЧекаККМ, ПроцентКомиссии, 
															| НачислятьБонусы, СлужебныйУчетБонусовПоДисконтнымКартам, 
															| ЧекФискализирован, КодАвторизации, ОплатаВыполнена");
	ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту;	
	//#11129 закомментировано
	//СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Метаданные().Имя, ВидОперации, Ложь);
	
	ОбщийМодульСервер.ЗагрузитьВТаблицуЗначений(ДанныеЗаполнения.РаспределениеПлатежа, ЭтотОбъект.РаспределениеПлатежа, Истина);
	
	ДобавитьОснование(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ЗаполнитьПоВозвратуОтПокупателя(ДанныеЗаполнения)
	
	ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту;
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратТовараОтПокупателя") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Контрагент 		= МассивДокументов[0].Контрагент;		
	Организация 	= МассивДокументов[0].Организация;
	Подразделение 	= МассивДокументов[0].Подразделение; // №12857
	Договор 		= МассивДокументов[0].ДоговорКонтрагента;
	Валюта 			= МассивДокументов[0].Валюта;
	
	СуммаДокумента = 0;
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		СуммаДокумента = СуммаДокумента + ЭлементМассива.СуммаДокумента;
	КонецЦикла;
	
	Сумма = СуммаДокумента;
	
КонецПроцедуры

//++ №14125
Процедура ЗаполнитьПоВозвратуПродукции(ДанныеЗаполнения)
	
	ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту;
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратПродукции") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Контрагент 		= МассивДокументов[0].Контрагент;		
	Организация 	= МассивДокументов[0].Организация;
	Подразделение 	= МассивДокументов[0].Подразделение;
	Договор 		= МассивДокументов[0].ДоговорКонтрагента;
	Валюта 			= МассивДокументов[0].Валюта;
	
	СуммаДокумента = 0;
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		СуммаДокумента = СуммаДокумента + ЭлементМассива.СуммаДокумента;
	КонецЦикла;
	
	Сумма = СуммаДокумента;
	
КонецПроцедуры
//-- №14125
	
Процедура ДобавитьОснование(ДанныеЗаполнения) Экспорт
	
	НайденныеСтроки = Основания.НайтиСтроки(Новый Структура("Основание", ДанныеЗаполнения));
	Если НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока = Основания.Добавить();
		НоваяСтрока.Основание = ДанныеЗаполнения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПроцентКомиссии() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.ПроцентКомиссии
	|ИЗ
	|	Справочник.ЭквайринговыеТерминалы.ВидыПлатежныхКарт КАК ЭквайринговыеТерминалыВидыПлатежныхКарт
	|ГДЕ
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.Ссылка = &ЭквайринговыйТерминал
	|	И ЭквайринговыеТерминалыВидыПлатежныхКарт.ВидПлатежнойКарты.Ссылка = &ВидПлатежнойКарты";
	Запрос.УстановитьПараметр("ЭквайринговыйТерминал",	ЭквайринговыйТерминал);
	Запрос.УстановитьПараметр("ВидПлатежнойКарты",		ВидПлатежнойКарты);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПроцентКомиссии = Выборка.ПроцентКомиссии;
	КонецЦикла;
	
	Если НЕ Сумма = 0 Тогда
		Комиссия = Сумма * (ПроцентКомиссии / 100);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
